# 1. Data Preparation

In [35]:
import pandas as pd

# Load the CSV files into DataFrames
# Please update the file paths to where your CSV files are located
amazon_sales = pd.read_csv('Amazon_Sale_Report.csv')
sale_report = pd.read_csv('Sale_Report.csv')
pl_report = pd.read_csv('P_L_March_2021.csv')
international_sales = pd.read_csv('International_sale_Report.csv')
price_2022 = pd.read_csv('May-2022.csv')

/var/folders/4y/z1bfqvc94wd18rd32n45zgr40000gn/T/ipykernel_6632/1168329622.py:5: DtypeWarning: Columns (23) have mixed types. Specify dtype option on import or set low_memory=False.
  amazon_sales = pd.read_csv('Amazon_Sale_Report.csv')

In [52]:
# Prepare ProductDetails
product_details = sale_report[[
    'SKU Code', 'Category', 'Design No.', 'Size', 'Color'
]].rename(columns={
    'SKU Code': 'sku',
    'Category': 'category',
    'Design No.': 'style_id',
    'Size': 'size',
    'Color': 'color'
}).drop_duplicates()

# pl_weight = pl_report[['Sku', 'Weight']].rename(columns={'Sku': 'sku', 'Weight': 'weight'})
# product_details = product_details.merge(pl_weight, on='sku', how='left')

# pl_weight2 = Price_2022[['Sku', 'Weight']].rename(columns={'Sku': 'sku', 'Weight': 'weight'})
# product_details = product_details.merge(pl_weight2, on='sku', how='left')

In [53]:
product_details.head()

             sku       category style_id size color
0    AN201-RED-L  AN : LEGGINGS    AN201    L   Red
1    AN201-RED-M  AN : LEGGINGS    AN201    M   Red
2    AN201-RED-S  AN : LEGGINGS    AN201    S   Red
3   AN201-RED-XL  AN : LEGGINGS    AN201   XL   Red
4  AN201-RED-XXL  AN : LEGGINGS    AN201  XXL   Red

In [54]:
# Prepare ProductCategories
product_categories = product_details[['category']].drop_duplicates().reset_index(drop=True)
product_categories['category_id'] = product_categories.index + 1

# Map category names to category_ids in ProductDetails
category_map = dict(zip(product_categories['category'], product_categories['category_id']))
product_details['category'] = product_details['category'].map(category_map)

In [55]:
product_categories

                category  category_id
0          AN : LEGGINGS            1
1                 BLOUSE            2
2                   PANT            3
3                 BOTTOM            4
4                PALAZZO            5
5                SHARARA            6
6                  SKIRT            7
7                  DRESS            8
8              KURTA SET            9
9          LEHENGA CHOLI           10
10                   SET           11
11                   TOP           12
12                 KURTA           13
13                   NaN           14
14              CROP TOP           15
15                 TUNIC           16
16              CARDIGAN           17
17              JUMPSUIT           18
18  CROP TOP WITH PLAZZO           19
19                 SAREE           20
20                 KURTI           21
21            NIGHT WEAR           22

In [41]:
# Map 'category' to 'category_id' using category_map
product_details['category'] = product_categories['category_id'].map(category_map)

# View the updated product_details DataFrame
product_details.head()

             sku  category style_id size color
0    AN201-RED-L       NaN    AN201    L   Red
1    AN201-RED-M       NaN    AN201    M   Red
2    AN201-RED-S       NaN    AN201    S   Red
3   AN201-RED-XL       NaN    AN201   XL   Red
4  AN201-RED-XXL       NaN    AN201  XXL   Red

In [56]:
# Prepare Stock
stock = sale_report[['SKU Code', 'Stock']].rename(columns={
    'SKU Code': 'sku',
    'Stock': 'stock'
})

In [57]:
stock.head()

             sku  stock
0    AN201-RED-L    5.0
1    AN201-RED-M    5.0
2    AN201-RED-S    3.0
3   AN201-RED-XL    6.0
4  AN201-RED-XXL    3.0

In [58]:
#Prepare PricingPlatforms

# Define relevant columns for platform-specific prices in `pl_report` (price_2021)
price_columns_2021 = [
    "Sku", "Amazon MRP", "Ajio MRP", "Flipkart MRP", "Limeroad MRP", 
    "Myntra MRP", "Paytm MRP", "Snapdeal MRP"
]
pricing_2021_raw = pl_report[price_columns_2021].rename(columns={"Sku": "sku"})

# Melt `pl_report` to reshape platform-specific prices into rows
pricing_2021_melted = pricing_2021_raw.melt(
    id_vars=["sku"], 
    var_name="platform_name", 
    value_name="price_2021"
)

# Clean platform names by removing " MRP"
pricing_2021_melted["platform_name"] = pricing_2021_melted["platform_name"].str.replace(" MRP", "", regex=False)

# Define relevant columns for platform-specific prices in `price_2022`
price_columns_2022 = [
    "Sku", "Amazon MRP", "Ajio MRP", "Flipkart MRP", "Limeroad MRP", 
    "Myntra MRP", "Paytm MRP", "Snapdeal MRP"
]
pricing_2022_raw = price_2022[price_columns_2022].rename(columns={"Sku": "sku"})

# Melt `price_2022` to reshape platform-specific prices into rows
pricing_2022_melted = pricing_2022_raw.melt(
    id_vars=["sku"], 
    var_name="platform_name", 
    value_name="price_2022"
)

# Clean platform names by removing " TP"
pricing_2022_melted["platform_name"] = pricing_2022_melted["platform_name"].str.replace(" MRP", "", regex=False)

# Merge the melted DataFrames for `price_2021` and `price_2022` on `sku` and `platform_name`
pricing = pricing_2021_melted.merge(pricing_2022_melted, on=["sku", "platform_name"], how="outer")

# Replace NaN values with 0 for consistency
pricing["price_2021"] = pricing["price_2021"].fillna(0)
pricing["price_2022"] = pricing["price_2022"].fillna(0)


# Display the head of the resulting DataFrame
pricing.head()

              sku platform_name price_2021 price_2022
0    Os206_3141_S        Amazon       2295       2295
1    Os206_3141_M        Amazon       2295       2295
2    Os206_3141_L        Amazon       2295       2295
3   Os206_3141_XL        Amazon       2295       2295
4  Os206_3141_2XL        Amazon       2295       2295

In [59]:
# Extract relevant columns for First vs Second-hand sales
first_vs_second_hand = pl_report[["Sku", "TP 1", "TP 2"]].rename(columns={
    "Sku": "sku",
    "TP 1": "first_hand_sales",
    "TP 2": "second_hand_sales"
})

# Save the cleaned FirstVsSecondHandSales data to CSV
#first_vs_second_hand.to_csv("/mnt/data/cleaned_first_vs_second_hand_sales.csv", index=False)

# Display the resulting DataFrame
first_vs_second_hand.head()

              sku first_hand_sales second_hand_sales
0    Os206_3141_S              538            435.78
1    Os206_3141_M              538            435.78
2    Os206_3141_L              538            435.78
3   Os206_3141_XL              538            435.78
4  Os206_3141_2XL              538            435.78

In [60]:
# Extract relevant location columns from the Amazon Sales dataset
location_raw = amazon_sales[[
    "ship-city", "ship-state", "ship-postal-code"
]].rename(columns={
    "ship-city": "ship_city",
    "ship-state": "ship_state",
    "ship-postal-code": "ship_postal_code"
})

# Drop duplicate rows to ensure each location is unique
location_cleaned = location_raw.drop_duplicates().reset_index(drop=True)

# Add a unique location_id
location_cleaned["location_id"] = location_cleaned.index + 1

# Reorder columns for clarity
location = location_cleaned[["location_id", "ship_city", "ship_state", "ship_postal_code"]]

# Display the resulting DataFrame
location.head()

   location_id    ship_city   ship_state  ship_postal_code
0            1       MUMBAI  MAHARASHTRA          400081.0
1            2    BENGALURU    KARNATAKA          560085.0
2            3  NAVI MUMBAI  MAHARASHTRA          410210.0
3            4   PUDUCHERRY   PUDUCHERRY          605008.0
4            5      CHENNAI   TAMIL NADU          600073.0

In [61]:
# Prepare Amazon Sales data
amazon_sales_clean = amazon_sales.rename(columns={
    "Order ID": "order_id",
    "SKU": "sku",
    "Date": "date",
    "Status": "status",
    "Qty": "qty",
    "Amount": "amount",
    "B2B": "b2b",
    "ship-city": "ship_city",
    "ship-state": "ship_state",
    "ship-postal-code": "ship_postal_code"
})
#promotion ids

# Select only relevant columns
amazon_sales_clean = amazon_sales_clean[[
    "order_id", "sku", "date", "status", 
     "qty", "amount", "b2b", #"promotion_ids",
    "ship_city", "ship_state", "ship_postal_code"
]]

# Convert date to datetime format
amazon_sales_clean["date"] = pd.to_datetime(amazon_sales_clean["date"])


amazon_sales_clean = amazon_sales_clean.merge(
    location[["location_id", "ship_city", "ship_state", "ship_postal_code"]],
    on=["ship_city", "ship_state", "ship_postal_code"],
    how="left"
)
amazon_sales_clean = amazon_sales_clean.drop(columns=["ship_city", "ship_state", "ship_postal_code"])

# Display the resulting DataFrame
amazon_sales_clean.head()

/var/folders/4y/z1bfqvc94wd18rd32n45zgr40000gn/T/ipykernel_6632/1740050092.py:24: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  amazon_sales_clean["date"] = pd.to_datetime(amazon_sales_clean["date"])

,order_id,sku,date,status,qty,amount,b2b,location_id
0,405-8078784-5731545,SET389-KR-NP-S,2022-04-30,Cancelled,0,647.62,False,1
1,171-9198151-1101146,JNE3781-KR-XXXL,2022-04-30,Shipped - Delivered to Buyer,1,406.00,False,2
2,404-0687676-7273146,JNE3371-KR-XL,2022-04-30,Shipped,1,329.00,True,3
3,403-9615377-8133951,J0341-DR-L,2022-04-30,Cancelled,0,753.33,False,4
4,407-1069790-7240320,JNE3671-TU-XXXL,2022-04-30,Shipped,1,574.00,False,5

In [62]:
# Prepare Deliveries
deliveries = amazon_sales.rename(columns={
    "Order ID": "order_id",
    "fulfilled-by": "fulfilled_by",
    "ship-service-level": "service_level",
    "ship-city": "ship_city",
    "ship-state": "ship_state",
    "ship-postal-code": "ship_postal_code"
})

# Select only relevant columns
deliveries = deliveries[[
    "order_id", "service_level",#fulfill 
    "ship_city", "ship_state", "ship_postal_code"
]]

# Merge with the Location table to add location_id
deliveries = deliveries.merge(
    location[["location_id", "ship_city", "ship_state", "ship_postal_code"]],
    on=["ship_city", "ship_state", "ship_postal_code"],
    how="left"
)

# Drop unnecessary location columns after mapping location_id
deliveries = deliveries.drop(columns=["ship_city", "ship_state", "ship_postal_code"])


# Display the resulting DataFrame
deliveries.head()

              order_id service_level  location_id
0  405-8078784-5731545      Standard            1
1  171-9198151-1101146      Standard            2
2  404-0687676-7273146     Expedited            3
3  403-9615377-8133951      Standard            4
4  407-1069790-7240320     Expedited            5

In [63]:
# Prepare InternationalSales
international_sales = international_sales.rename(columns={
    "SKU": "sku",
    "PCS": "sales_count",
    "GROSS AMT": "sales_amount"
})

# Aggregate data by sku to ensure unique entries
international_sales_cleaned = international_sales.groupby("sku").agg({
    "sales_count": "sum",  # Total sales count per SKU
    "sales_amount": "sum"  # Total sales amount per SKU
}).reset_index()

# Display the resulting DataFrame
international_sales_cleaned.head()

                sku sales_count sales_amount
0    AN202-ORANGE-L  1.00281.00  281.0014.00
1    AN202-ORANGE-M  1.00281.00   281.008.00
2    AN202-ORANGE-S  1.00281.00  281.0020.00
3   AN202-ORANGE-XL  1.00281.00  281.0013.00
4  AN202-ORANGE-XXL  1.00281.00  281.0024.00

In [64]:
# Handle ProductDetails
product_details.dropna(subset=["sku"], inplace=True)  # Drop rows with missing sku
product_details["style_id"].fillna("Unknown", inplace=True)  # Fill missing style_id
product_details["size"].fillna("Unknown", inplace=True)  # Fill missing size
product_details["color"].fillna("Unknown", inplace=True)  # Fill missing color

# Handle ProductCategories
product_categories["category"].fillna("Uncategorized", inplace=True)  # Fill missing category

# Handle Stock
stock.dropna(subset=["sku"], inplace=True)  # Drop rows with missing sku
stock["stock"].fillna(0, inplace=True)  # Fill missing stock with 0

# Handle AmazonSales
amazon_sales_clean["amount"].fillna(0, inplace=True)  # Fill missing amount with 0

# Handle Location
location.fillna("Unknown", inplace=True)  # Fill missing location fields with "Unknown"

# Recheck for remaining nulls
cleaned_dataframes = {
    "ProductDetails": product_details,
    "ProductCategories": product_categories,
    "Stock": stock,
    "PricingPlatforms": pricing,
    "AmazonSales": amazon_sales_clean,
    "Location": location,
    "Deliveries": deliveries,
    "InternationalSales": international_sales_cleaned,
    "FirstVsSecondHandSales": first_vs_second_hand
}

# Check for nulls after handling
null_summary = {name: df.isnull().sum() for name, df in cleaned_dataframes.items()}
for name, nulls in null_summary.items():
    print(f"--- {name} ---\n{nulls}\n")

# Save cleaned data to CSV files
product_details.to_csv('cleaned_product_details.csv', index=False)
product_categories.to_csv('cleaned_product_categories.csv', index=False)
stock.to_csv('cleaned_stock.csv', index=False)
pricing.to_csv('cleaned_pricing_platforms.csv', index=False)
amazon_sales_clean.to_csv('cleaned_amazon_sales.csv', index=False)
location.to_csv('cleaned_location.csv', index=False)
deliveries.to_csv('cleaned_deliveries.csv', index=False)
international_sales_cleaned.to_csv('cleaned_international_sales.csv', index=False)
first_vs_second_hand.to_csv('cleaned_first_vs_second_hand_sales.csv', index=False)

/var/folders/4y/z1bfqvc94wd18rd32n45zgr40000gn/T/ipykernel_6632/839458306.py:18: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Unknown' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  location.fillna("Unknown", inplace=True)  # Fill missing location fields with "Unknown"

--- ProductDetails ---
sku         0
category    0
style_id    0
size        0
color       0
dtype: int64

--- ProductCategories ---
category       0
category_id    0
dtype: int64

--- Stock ---
sku      0
stock    0
dtype: int64

--- PricingPlatforms ---
sku              0
platform_name    0
price_2021       0
price_2022       0
dtype: int64

--- AmazonSales ---
order_id       0
sku            0
date           0
status         0
qty            0
amount         0
b2b            0
location_id    0
dtype: int64

--- Location ---
location_id         0
ship_city           0
ship_state          0
ship_postal_code    0
dtype: int64

--- Deliveries ---
order_id         0
service_level    0
location_id      0
dtype: int64

--- InternationalSales ---
sku             0
sales_count     0
sales_amount    0
dtype: int64

--- FirstVsSecondHandSales ---
sku                  0
first_hand_sales     0
second_hand_sales    0
dtype: int64

# 2. Build Database and Load the Data

In [65]:
import psycopg2
from sqlalchemy import create_engine

# Define the connection 
conn_url = 'postgresql://postgres:123@localhost:5432/E-Commerce Sales Dataset.6'

# Create an engine that connects PostgreSQL
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

# Pass the SQL statement
stmt = """
CREATE TABLE ProductCategories (
    category_id INT PRIMARY KEY,      -- customed ID 
    category_name VARCHAR(100)        -- Sale Report: Category 
);

CREATE TABLE ProductDetails (
    sku VARCHAR(50) PRIMARY KEY,      -- Sale Report: SKU Code 
    category_id INT,                  -- Foreign key to ProductCategories
    style_id VARCHAR(50),             -- Sale Report: Design No. 
    size VARCHAR(20),                 -- Sale Report: Size 
    color VARCHAR(50),                -- Sale Report: Color 
    FOREIGN KEY (category_id) REFERENCES ProductCategories(category_id)
);

CREATE TABLE Stock (
    sku VARCHAR(50) PRIMARY KEY,      -- Sale Report: SKU Code 
    stock INT                         -- Sale Report: Stock 
);

CREATE TABLE PricingPlatforms (
    sku VARCHAR(50),                  -- SKU 
    platform_name VARCHAR(50),        -- Platform name (such as "Amazon", "Flipkart",etc.) 
    price_2021 DECIMAL(10, 2),        -- 2021 yr price 
    price_2022 DECIMAL(10, 2),        -- 2022 yr price 
    PRIMARY KEY (sku, platform_name)  -- Primary Key SKU + Platform 
);

CREATE TABLE AmazonSales (
    order_id VARCHAR(50) PRIMARY KEY, -- Amazon Sale Report: Order ID 
    sku VARCHAR(50),                  -- Amazon Sale Report: SKU 
    date DATE,                        -- Amazon Sale Report: Date 
    status VARCHAR(50),               -- Amazon Sale Report: Status 
    qty INT,                          -- Amazon Sale Report: Qty 
    amount DECIMAL(10, 2),            -- Amazon Sale Report: Amount 
    b2b BOOLEAN,                      -- Amazon Sale Report: B2B  
    location_id INT                   -- Foreign key Location 
);

CREATE TABLE InternationalSales (
    sku VARCHAR(50) PRIMARY KEY,      -- International sale Report: SKU 
    sales_count INT,                  -- International sale Report: PCS 
    sales_amount DECIMAL(10, 2)       -- International sale Report: GROSS AMT 
);

CREATE TABLE Deliveries (
    order_id VARCHAR(50) PRIMARY KEY, -- Amazon Sale Report: Order ID 
    ship_service_level VARCHAR(50),   -- Amazon Sale Report: ship-service-level 
    location_id INT,                  -- Foreign key Location 
    FOREIGN KEY (order_id) REFERENCES AmazonSales(order_id)
);

CREATE TABLE FirstVsSecondHandSales (
    sku VARCHAR(50) PRIMARY KEY,      -- related to "P & L March 2021.csv" and "May-2022.csv" SKU 
    first_hand_sales DECIMAL(10, 2),  -- sales price ("TP 1" or "TP 2" 的价格) 
    second_hand_sales DECIMAL(10, 2)  -- sales amount ("TP 1" or "TP 2" price) 
);

CREATE TABLE Location (
    location_id INT PRIMARY KEY,      -- customed ID 
    ship_city VARCHAR(100),           -- Amazon Sale Report: ship-city 
    ship_state VARCHAR(100),          -- Amazon Sale Report: ship-state 
    ship_postal_code VARCHAR(20)      -- Amazon Sale Report: ship-postal-code 
);
"""

# Execute the statement to create tables
connection.execute(stmt)

### Product Categories Table

In [66]:
# Save the product_categories DataFrame to the ProductCategories table in your database
product_categories.to_sql('ProductCategories', con=engine, if_exists='replace', index=False)

print("ProductCategories table successfully loaded into the database.")

ProductCategories table successfully loaded into the database.

In [78]:
product_categories.head()

        category  category_id
0  AN : LEGGINGS            1
1         BLOUSE            2
2           PANT            3
3         BOTTOM            4
4        PALAZZO            5

### Product Details Table

In [67]:
print(product_details['category'].dtype)
print(product_categories['category'].dtype)

int64
object

In [68]:
product_details.head()

             sku  category style_id size color
0    AN201-RED-L         1    AN201    L   Red
1    AN201-RED-M         1    AN201    M   Red
2    AN201-RED-S         1    AN201    S   Red
3   AN201-RED-XL         1    AN201   XL   Red
4  AN201-RED-XXL         1    AN201  XXL   Red

In [69]:
product_details.rename(columns={'category': 'category_id'}, inplace=True)
print(product_details.head())

             sku  category_id style_id size color
0    AN201-RED-L            1    AN201    L   Red
1    AN201-RED-M            1    AN201    M   Red
2    AN201-RED-S            1    AN201    S   Red
3   AN201-RED-XL            1    AN201   XL   Red
4  AN201-RED-XXL            1    AN201  XXL   Red

In [70]:
# # Save the product_categories DataFrame to the ProductDetails Table
product_details.to_sql('ProductDetails', con=engine, if_exists='append', index=False)

print("ProductDetails table loaded successfully!")

ProductDetails table loaded successfully!

### Stock Table

In [71]:
stock.to_sql('Stock', con=engine, if_exists='append', index=False)

print("Stock table loaded successfully!")

Stock table loaded successfully!

### PricingPlatforms Table

In [72]:
pricing.to_sql('PricingPlatforms', con=engine, if_exists='append', index=False)

print("PricingPlatforms table loaded successfully!")

PricingPlatforms table loaded successfully!

### AmazonSales Table

In [73]:
amazon_sales_clean.to_sql('AmazonSales', con=engine, if_exists='append', index=False)

print("AmazonSales table loaded successfully!")

AmazonSales table loaded successfully!

### International Sale Table

In [74]:
international_sales_cleaned.to_sql('InternationalSales', con=engine, if_exists='append', index=False)

print("InternationalSales table loaded successfully!")

InternationalSales table loaded successfully!

### Deliveries Table

In [75]:
deliveries.rename(columns={'service_level': 'ship_service_level'}, inplace=True)

deliveries.to_sql('Deliveries', con=engine, if_exists='append', index=False)

print("Deliveries table loaded successfully!")

Deliveries table loaded successfully!

### FirstVsSecondHandSales Table

In [76]:
first_vs_second_hand.to_sql(
    'FirstVsSecondHandSales',  
    con=engine,       
    if_exists='append',    
    index=False             
)

print("FirstVsSecondHandSales table loaded successfully!")

FirstVsSecondHandSales table loaded successfully!

### Location Table

In [77]:
location.to_sql(
    'Location',           
    con=engine,           
    if_exists='append',    
    index=False              
)

print("Location table loaded successfully!")

Location table loaded successfully!